# DataFrame creation: Using a dictionary of dictionaries

In [2]:
import pandas as pd

data= {'Name': {'AW': 'Amy White', 'JS': 'Jack Stewart','RL': 'Richard Lauderdale','SJ': 'Sara Johnson'},
                  'Age' : {'AW': 50, 'JS': 53,'RL': 35,'SJ': 43},
                  'Working Experience (Yrs.)' : {'AW': 5,'JS': 8,'RL': 3,'SJ': 10}
       }

df = pd.DataFrame(data)
df

                  Name  Age  Working Experience (Yrs.)
AW           Amy White   50                          5
JS        Jack Stewart   53                          8
RL  Richard Lauderdale   35                          3
SJ        Sara Johnson   43                         10

In [ ]:
##Column names are created from the keys of the main dictionary,
and the row index is created from the keys of the sub dictionaries.

# DataFrame creation: Using a dictionary lists

In [3]:
import pandas as pd

data= {'Name': ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'],
                  'Age' : [50, 53, 35, 43],
                  'Working Experience (Yrs.)' : [5, 8, 3, 10]}

df = pd.DataFrame(data, index=['AW','JS','RL','SJ'])
df

                  Name  Age  Working Experience (Yrs.)
AW           Amy White   50                          5
JS        Jack Stewart   53                          8
RL  Richard Lauderdale   35                          3
SJ        Sara Johnson   43                         10

# DataFrame creation: Using a dictionary of series

In [4]:
import pandas as pd

ser1 = pd.Series(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], index = ['AW','JS','RL','SJ'])
ser2 = pd.Series([50, 53, 35, 43], index = ['AW','JS','RL','SJ'])
ser3 = pd.Series([5, 8, 3, 10], index = ['AW','JS','RL','SJ'])

a_dict = {'Name': ser1,
          'Age': ser2,
          'Working Experience (Yrs.)': ser3}

df = pd.DataFrame(a_dict)
df

                  Name  Age  Working Experience (Yrs.)
AW           Amy White   50                          5
JS        Jack Stewart   53                          8
RL  Richard Lauderdale   35                          3
SJ        Sara Johnson   43                         10

# Create a dictionary called data where the value should be panda series. Store the panda series in variable named 'names' , 'age',  and working experience'

In [5]:
import pandas as pd

names = pd.Series(['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'])
age = pd.Series([50, 53, 35, 43])
working_experience_yrs = pd.Series([5, 8, 3, 10])

data = {'Name': names,
          'Age': age,
          'Working Experience (Yrs.)': working_experience_yrs}

df = pd.DataFrame(data)
df

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

# Create a dictionary called data where the value should be list. Store the list in the variable named 'names' , 'age', and working experience'

In [6]:
import pandas as pd

names = ['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson']
age = [50, 53, 35, 43]
working_experience_yrs = [5, 8, 3, 10]

data = {'Name': names,
          'Age': age,
          'Working Experience (Yrs.)': working_experience_yrs}

df = pd.DataFrame(data)
df

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

# create a list called data where the values should be lists.

In [7]:
import pandas as pd

data = [['Amy White', 50, 5],['Jack Stewart', 53, 8], ['Richard Lauderdale', 35, 3], ['Sara Johnson', 43, 10]]


df = pd.DataFrame(data, columns=['Name','Age', 'Working Experience (Yrs.)'])
df

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10

# Putting index number

In [8]:
data = {
    "Name":['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], 
    "Age":[50, 53, 35, 43], 
    "Working Experience (Yrs.)":[5,8,3,10]}
df = pd.DataFrame(data, index=[1,2,3,4])
df

                 Name  Age  Working Experience (Yrs.)
1           Amy White   50                          5
2        Jack Stewart   53                          8
3  Richard Lauderdale   35                          3
4        Sara Johnson   43                         10

In [9]:
import pandas as pd

data = {'item': ['laptop', 'monitor', 'HDMI', 'speaker'],
        'cost': [500, 300, 700, 600]
       }

df = pd.DataFrame(data)
df

      item  cost
0   laptop   500
1  monitor   300
2     HDMI   700
3  speaker   600

# data sorting using sort_values

In [12]:
sorted_data = df.sort_values(by= 'cost', ascending=False)
sorted_data

      item  cost
2     HDMI   700
3  speaker   600
0   laptop   500
1  monitor   300

# Sort DataFrame based on columns

In [14]:
import pandas as pd
hostelCandidates1 = pd.DataFrame({'col2': [150, 170, 160],
                                  'col1': [70, 55, 60]},
                                 index=[3, 2, 1])
print('original DataFrame')
print(hostelCandidates1)

# sorted temporarily based on column labels
print('Sorted by column name')
hostelCandidates1.sort_index(axis=1)

original DataFrame
   col2  col1
3   150    70
2   170    55
1   160    60
Sorted by column name

   col1  col2
3    70   150
2    55   170
1    60   160

# Sort DataFrame based on index

In [15]:
import pandas as pd
 
# create 2 dataframes with different indexes
hostelCandidates1 = pd.DataFrame({'col2': [150, 170, 160],
                                  'col1': [70, 55, 60]},
                                 index=[3, 2, 1])
print('original DataFrame')
print(hostelCandidates1)
 
# sorted temporarily based on index labels
print('Sorted by index')
hostelCandidates1.sort_index(axis=0)

original DataFrame
   col2  col1
3   150    70
2   170    55
1   160    60
Sorted by index

   col2  col1
1   160    60
2   170    55
3   150    70

# Example Code to sort the DataFrame & save changes permanently on original DataFrame:

In [ ]:
import pandas as pd
 
# create 2 dataframes with different indexes
hostelCandidates1 = pd.DataFrame({'col2': [150, 170, 160],
                                  'col1': [70, 55, 60]},
                                 index=[3, 2, 1])
print('original DataFrame')
print(hostelCandidates1)
 
# sorted permanently based on column labels
hostelCandidates1.sort_index(axis=1, inplace=True)

In [18]:
data = {
    "Name":['Amy White', 'Jack Stewart', 'Richard Lauderdale', 'Sara Johnson'], 
    "Age":[50, 53, 35, 43], 
    "Working Experience (Yrs.)":[5,8,3,10]}
df = pd.DataFrame(data)
df = df.sort_index(ascending=True)
print(df)

                 Name  Age  Working Experience (Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10